SELECT v.*, r.`近30天会员订单占比`, r.`近30天会员订单数`, r.`近30天订单数`, r.`排名开始日`, r.`排名截止日`, r.`近7天总营业额`, m.`会员对比开始日`, m.`会员对比截止日`, m.`会员对比占比`, m.`会员对比订单数`, m.`会员对比会员订单数`, m.`会员对比有效天数`, m.`会员对比缺失天数`, m.`会员对比识别覆盖率`, m.`会员对比状态`, m.`会员对比前期占比`, m.`会员对比前期状态`, m.`会员对比变化`, m.`会员对比分公司名次`, m.`会员对比分公司中位`, m.`会员对比分公司分位`, m.`会员对比城市名次`, m.`会员对比城市中位`, m.`会员对比城市分位`, m.`会员对比店型名次`, m.`会员对比店型中位`, m.`会员对比店型分位`, d.`会员异常诊断`, s.`堂食汤底订单基数`, s.`堂食有效汤底订单`, s.`外卖汤底订单基数`, s.`外卖有效汤底订单`, rp.`堂食复购开始日`, rp.`堂食复购截止日`, rp.`堂食复购观察天数`, rp.`会员堂食顾客数`, rp.`会员堂食复购顾客数`, rp.`会员堂食复购率`, rp.`会员堂食复购参评状态`, rp.`同店型会员复购门店数`, rp.`同店型会员复购中位`, rp.`非会员堂食顾客数`, rp.`非会员堂食复购顾客数`, rp.`非会员堂食复购率`, rp.`非会员堂食复购参评状态`, rp.`同店型非会员复购门店数`, rp.`同店型非会员复购中位`, rp.`同店型会员复购前25门槛`, rp.`同店型非会员复购前25门槛`
FROM (
SELECT v.*, date_sub(current_date(), 1) AS `统计截止日`, current_timestamp() AS `专供更新时间`
FROM (
SELECT
  `门店名称` AS `门店名称`,
  trim(cast(`门店编号` AS STRING)) AS `门店编号`,
  `分公司` AS `分公司`,
  `地理城市` AS `地理城市`,
  `门店类型` AS `门店类型`,
  `开业日期` AS `开业日期`,
  COUNT(DISTINCT `门店编号`) AS `门店数`
FROM input1
GROUP BY trim(cast(`门店编号` AS STRING)),`门店名称`, `分公司`, `地理城市`, `门店类型`, `开业日期`
) v
) v
LEFT SEMI JOIN input2 a ON v.`门店名称` = a.`门店名称`
LEFT JOIN input3 r ON v.`门店名称` = r.`门店名称`

LEFT JOIN input4 m ON v.`门店编号`=m.`门店编号`

LEFT JOIN input5 d ON v.`门店名称`=d.`门店名称`
LEFT JOIN input6 s ON v.`门店名称`=s.`门店名称`

LEFT JOIN input7 rp ON v.`门店编号`=rp.`门店编号`
